"About ThumbsUp" = "Über ThumbsUp";
"Check for Updates" = "Nach neuer Version suchen";
"Preferences..." = "Einstellungen...";
"Services" = "Dienste";
"Hide ThumbsUp" = "ThumbsUp ausblenden";
"Hide Others" = "Andere ausblenden";
"Show All" = "Alle einblenden";
"Quit ThumbsUp" = "ThumbsUp beenden";
"Edit" = "Bearbeiten";
"Undo" = "Widerrufen";
"Redo" = "Wiederholen";
"Cut" = "Ausschneiden";
"Copy" = "Kopieren";
"Paste" = "Einsetzen";
"Delete" = "Löschen";
"Select All" = "Alles auswählen";
"Window" = "Fenster";
"Close Window" = "Schließen";
"Close All" = "Alle schließen";
"Zoom Window" = "Zoomen";
"Minimize Window" = "Im Dock ablegen";
"Bring All to Front" = "Alle nach vorne bringen";
"Help" = "Hilfe";
"ThumbsUp Help" = "ThumbsUp Hilfe";
"Preferences" = "Einstellungen";

"General" = "Allgemein";
"Extension:" = "Erweiterung:";
"Name:" = "Name:";
"Prefix" = "Präfix";
"Suffix" = "Suffix";
"Folder" = "Ordner";
"Format:" = "Format:";
"Quit when done" = "Beenden sobald fertig";

"Create..." = "Erzeuge...";
"Thumbnails" = "Vorschaubilder";
"Thumbnails with Icons" = "Vorschaubilder & Symbole";
"Icons for Originals" = "Symbole für Originale";

"Sizing" = "Größe";
"Limit:" = "Limit:";
"Scale:" = "Skalieren:";
"Percent" = "Prozent";
"pixels" = "Punkte";

"Compression & Quality" = "Kompression & Qualität";
"Antialiasing:" = "Antialiasing:";
"None" = "Aus";
"Low" = "Gering";
"High" = "Hoch";
"Sharpen:" = "Schärfen:";
"Off" = "Aus";
"Light" = "Leicht";
"Medium" = "Mittel";
"Strong" = "Stark";

"Forum" = "Anwenderforum";
"Feedback" = "Kontakt";
"Release Notes" = "Release Notes";